УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартКонечнаяДатаРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартДатаПродленияРезервов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартРезервЗаканчивается</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="025cec6b-a37b-4836-802d-b862a2c24680">
    <name>смартВидТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb1bda59-7ed7-46ee-9737-0e55e9b9f6e6">
    <name>смартНомерМашины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2b9ec282-ad92-44cb-b072-47a36f857325">
    <name>смартНомерПрицепа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b1471b7a-c73b-41fd-afa0-58788430b04b">
    <name>смартФИОВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33b186f2-2628-48f3-a24e-adfce58bd35d">
    <name>смартНомерСерияПаспортВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3e9aa296-d524-418d-84ab-e9bea83d77eb">
    <name>смартДатаВыдачиПаспортаВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2f61b178-446c-49e4-b3cd-cf9f1c061abf">
    <name>смартЖелаемаяДатаОтгрузкиАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="671c355b-5223-4837-980b-5f9cd7f8cc7d">
    <name>смартЖелаемоеВремяОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fbce0c46-a4a3-49a3-aca2-e423debd297a">
    <name>смартФИОВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e99f34bd-4d77-4c27-a9bd-de06fcacc876">
    <name>смартНомерСерияПаспортВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7ac5896-d91d-4ee4-93dc-84fb50a8fe9f">
    <name>смартДатаВыдачиПаспортаВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НачалоОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОкончаниеПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/CommonModules/НоменклатураСервер/Module.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ПроверитьСериюРассчитатьСтатусПриИзмененииРеквизитаВТЧ")
Функция смарт_ПроверитьСериюРассчитатьСтатусПриИзмененииРеквизитаВТЧ(ТекущаяСтрока, Склад, ПараметрыУказанияСерий)
	МетаданныеОбъекта = ОбщегоНазначенияУТ.МетаданныеОбъектаПоПолномуИмени(ПараметрыУказанияСерий.ПолноеИмяОбъекта);

	Суффиксы = Новый Массив;
	Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
		Суффиксы.Добавить("");
	Иначе
		Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
			Суффикс = НоменклатураКлиентСервер.СуффиксВИмениПоляСтатусУказанияСерий(ИмяПоляСтатус);

			Если МетаданныеОбъекта.ТабличныеЧасти[ПараметрыУказанияСерий.ИмяТЧТовары].Реквизиты.Найти("Серия" + Суффикс) <> Неопределено Тогда
				Суффиксы.Добавить(Суффикс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Серия");
	СтруктураВозврата.Вставить("УказыватьСерии");

	СтруктураВозврата.Серия = ТекущаяСтрока.Серия;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК РазличаютсяВладельцыСерииИНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура,
	|	Справочник.СерииНоменклатуры КАК Серии
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Серии.Ссылка = &Серия
	|	И НЕ(Серии.ВидНоменклатуры.ВладелецСерий = Номенклатура.ВидНоменклатуры.ВладелецСерий
	|					И Серии.ВидНоменклатуры.ВладелецСерий <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|					И Номенклатура.ВидНоменклатуры.ВладелецСерий <> ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|				ИЛИ Номенклатура.ВладелецСерий = Серии.ВидНоменклатуры
	|				ИЛИ Номенклатура.ВидНоменклатуры = Серии.ВидНоменклатуры)";
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
	Запрос.УстановитьПараметр("Серия", ТекущаяСтрока.Серия);
	Если Не Запрос.Выполнить().Пустой() Тогда
		СтруктураВозврата.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
		СтруктураВозврата.Вставить("СтатусУказанияСерий");
	Иначе
		Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
			СтруктураВозврата.Вставить(ИмяПоляСтатус);
		КонецЦикла;
	КонецЕсли;

	Если Не ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры Тогда

		СтруктураВозврата.Серия               = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
			СтруктураВозврата.СтатусУказанияСерий = 0;
		Иначе
			Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
				СтруктураВозврата[ИмяПоляСтатус] = 0;
			КонецЦикла;
		КонецЕсли;
		СтруктураВозврата.УказыватьСерии      = Ложь;

		Возврат СтруктураВозврата;
	КонецЕсли;

	ТаблицаТоваров = Новый ТаблицаЗначений;
	Для Каждого Суффикс Из Суффиксы Цикл
		ТаблицаТоваров.Колонки.Добавить("Номенклатура"+Суффикс,Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("Характеристика"+Суффикс,Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаТоваров.Колонки.Добавить("Серия"+Суффикс,Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	КонецЦикла;

	ТаблицаТоваров.Колонки.Добавить(ПараметрыУказанияСерий.ИмяПоляКоличество,Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));

	ДополнитьТаблицуКолонкамиПоПолямПараметровУказанияСерий(ПараметрыУказанияСерий, ТаблицаТоваров, МетаданныеОбъекта);

	ТаблицаСерий = Новый ТаблицаЗначений;
	ТаблицаСерий.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСерий.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаСерий.Колонки.Добавить(ПараметрыУказанияСерий.ИмяПоляКоличество,Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));

	ДополнитьТаблицуКолонкамиПоПолямПараметровУказанияСерий(ПараметрыУказанияСерий, ТаблицаСерий, МетаданныеОбъекта, Истина);

	СтрокаТовара = ТаблицаТоваров.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТовара,ТекущаяСтрока);
	СтрокаТовара.НомерСтроки = 1;
	СтрокаТовара.Серия = СтруктураВозврата.Серия;

	Выборка = ВыборкаИзЗапросаРасчетаСтатусовУказанияСерий(ПараметрыУказанияСерий, ТаблицаТоваров, ТаблицаСерий, Склад);

	Если Выборка.Следующий() Тогда

		// Если серии указываются в отдельной ТЧ, то при изменении реквизитов
		// будут пересчитаны только статусы, связанные с сериями, указываемыми
		// в ТЧ "Товары" (т.е. по которым ведется учет себестоимости).
		Если НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(Выборка.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда

			Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
				СтруктураВозврата.СтатусУказанияСерий = Выборка.СтатусУказанияСерий;
			Иначе
				Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
					СтруктураВозврата[ИмяПоляСтатус] = Выборка[ИмяПоляСтатус];
				КонецЦикла;
			КонецЕсли;

		Иначе
			Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
				СтруктураВозврата.СтатусУказанияСерий = ТекущаяСтрока.СтатусУказанияСерий;
			Иначе
				Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
					СтруктураВозврата[ИмяПоляСтатус] = ТекущаяСтрока[ИмяПоляСтатус];
				КонецЦикла;
			КонецЕсли;

		КонецЕсли;

		Если НоменклатураКлиентСервер.ВЭтомСтатусеСерииНеУказываются(СтруктураВозврата.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда
			СтруктураВозврата.УказыватьСерии = Ложь;
			СтруктураВозврата.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		КонецЕсли;

	Иначе
		Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
			СтруктураВозврата.СтатусУказанияСерий = ТекущаяСтрока.СтатусУказанияСерий;
		Иначе
			Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
				СтруктураВозврата[ИмяПоляСтатус] = ТекущаяСтрока[ИмяПоляСтатус];
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	#Вставка
	//++#1517 смарт: Лопато 03.04.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
	РезультатСтатусУказанияСерий = 0;		

	Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
		РезультатСтатусУказанияСерий = СтруктураВозврата.СтатусУказанияСерий;
	Иначе
		Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
			Если СтруктураВозврата[ИмяПоляСтатус] <> 0 Тогда
				РезультатСтатусУказанияСерий = СтруктураВозврата[ИмяПоляСтатус];
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;

	Если РезультатСтатусУказанияСерий <> 0 Тогда

		смартДатаНачалаСерийногоУчетаВременная = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура, "смартДатаНачалаСерийногоУчетаВременная");

		Если смартОбщегоНазначения.смартДействуетОсобыйУчетСерий(ТекущаяСтрока.Номенклатура) 
			И ЗначениеЗаполнено(смартДатаНачалаСерийногоУчетаВременная) Тогда
			
			ДатаОбъекта = смартОбщегоНазначения.смартПолучитьДатуОбъектаДляРасчетаСтатусовСерий(ТекущаяСтрока, ПараметрыУказанияСерий);
			
			//Стоит галка в расходном ордере "Без серий"
			//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
			СтрокаБезСерии = 
				(МетаданныеОбъекта.ТабличныеЧасти[ПараметрыУказанияСерий.ИмяТЧТовары].Реквизиты.Найти("смартОтгрузкаБезСерииСлужебныйВременный") <> Неопределено
					 И ТекущаяСтрока.смартОтгрузкаБезСерииСлужебныйВременный = Истина);
					 
			Если НЕ ДатаОбъекта = НачалоДня(ДатаОбъекта) Тогда		 
				ДатаНачалаСерийногоУчетаНеНаступила = ДатаОбъекта < смартДатаНачалаСерийногоУчетаВременная;
			Иначе	
				ДатаНачалаСерийногоУчетаНеНаступила = НачалоДня(ДатаОбъекта) < НачалоДня(смартДатаНачалаСерийногоУчетаВременная);
			КонецЕсли;	
					 
			Если СтрокаБезСерии 
				ИЛИ ДатаНачалаСерийногоУчетаНеНаступила Тогда

				СтруктураВозврата.УказыватьСерии = Ложь;

				Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
					СтруктураВозврата.СтатусУказанияСерий = 0;
				Иначе
					Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
						СтруктураВозврата[ИмяПоляСтатус] = 0;
					КонецЦикла;
				КонецЕсли;

			КонецЕсли;
            //--#1775 смарт: Лопато 12.04.2024

		КонецЕсли;

	КонецЕсли;
	//--#1517 смарт: Лопато 03.04.2024
	#КонецВставки
	
	Возврат СтруктураВозврата;

КонецФункции
		
&ИзменениеИКонтроль("ЗаполнитьСтатусыУказанияСерий")
Процедура смарт_ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий, СтрокиТоваровДляОбработки, СтрокиСерийДляОбработки)
	
	Если Не (ПараметрыУказанияСерий.ТоварВШапке
		Или Объект[ПараметрыУказанияСерий.ИмяТЧТовары].Количество() <> 0 ) Тогда
		Возврат;
	КонецЕсли;

	Если Не ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры Тогда

		Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
			Если ПараметрыУказанияСерий.ТоварВШапке Тогда
				Объект.СтатусУказанияСерий = 0;	
			Иначе
				Для Каждого СтрТабл Из Объект[ПараметрыУказанияСерий.ИмяТЧТовары] Цикл
					Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
						СтрТабл.СтатусУказанияСерий = 0;
					Иначе
						Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
							СтрТабл[ИмяПоляСтатус] = 0;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		Возврат;
	КонецЕсли;

	СкладыВТЧ = ПараметрыУказанияСерий.ПоляСвязи.Найти(ПараметрыУказанияСерий.ИмяПоляСклад) <> Неопределено
	Или ПараметрыУказанияСерий.ИменаПолейДополнительные.Найти(ПараметрыУказанияСерий.ИмяПоляСклад) <> Неопределено;

	Если Не СкладыВТЧ
		И ПараметрыУказанияСерий.ИмяПоляСклад <> Неопределено Тогда

		Если ПараметрыУказанияСерий.ИмяПоляСкладОтправитель <> Неопределено
			И ПараметрыУказанияСерий.ИмяПоляСкладПолучатель <> Неопределено Тогда
			Склад = Новый Структура("Отправитель,Получатель");
			Склад.Отправитель = Объект[ПараметрыУказанияСерий.ИмяПоляСкладОтправитель];
			Склад.Получатель  = Объект[ПараметрыУказанияСерий.ИмяПоляСкладПолучатель];
		Иначе
			Склад = Объект[ПараметрыУказанияСерий.ИмяПоляСклад];
		КонецЕсли;

	Иначе
		Склад = Неопределено;
	КонецЕсли;

	Если ПараметрыУказанияСерий.ТоварВШапке Тогда

		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаТоваров.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ТаблицаТоваров.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
		ТаблицаТоваров.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));

		Если ЗначениеЗаполнено(ПараметрыУказанияСерий.ИмяТЧСерии) Тогда
			ТаблицаСерий = Объект[ПараметрыУказанияСерий.ИмяТЧСерии];
		Иначе
			ТаблицаСерий = Новый ТаблицаЗначений;
			ТаблицаСерий.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаСерий.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			ТаблицаСерий.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
			ТаблицаСерий.Колонки.Добавить("Назначение",Новый ОписаниеТипов("СправочникСсылка.Назначения"));
			ТаблицаСерий.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));

			СтрокаСерии = ТаблицаСерий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСерии, Объект);
		КонецЕсли;

		ДополнитьТаблицуКолонкамиПоПолямПараметровУказанияСерий(ПараметрыУказанияСерий, ТаблицаТоваров);

		СтрокаТовара = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара,Объект);
		Если ПараметрыУказанияСерий.ЭтоЗаказ
			И ПараметрыУказанияСерий.СкладскиеОперации.Найти(Перечисления.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки) <> Неопределено
			И Объект.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда
			// В шапке заказов при смене варианта обеспечения не очищается назначение,
			//	поэтому для необособленной отгрузки очистим назначение здесь.
			СтрокаТовара.Назначение = Справочники.Назначения.ПустаяСсылка();
		КонецЕсли;
		СтрокаТовара.НомерСтроки = 1;

		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Назначение");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовара);
		НайденныеСтрокиСерий = ТаблицаСерий.НайтиСтроки(СтруктураПоиска);

		Выборка = ВыборкаИзЗапросаРасчетаСтатусовУказанияСерий(ПараметрыУказанияСерий,
		ТаблицаТоваров,
		ТаблицаСерий,
		Склад,
		,
		НайденныеСтрокиСерий);

		Если Выборка.Следующий() Тогда

			Объект.СтатусУказанияСерий = Выборка.СтатусУказанияСерий;

			#Удаление //++ #Б-2794 смарт: Лопато 26.03.2025 //Документ Заказ на сборку. Не отображается поле Серия.
			Если Выборка.СтатусУказанияСерий <> 14 Тогда
				Объект.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			#КонецУдаления
			
			#Вставка
			//++ #Б-2794 смарт: Лопато 26.03.2025 //Документ Заказ на сборку. Не отображается поле Серия.  
			смартДатаНачалаСерийногоУчетаВременная = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "смартДатаНачалаСерийногоУчетаВременная");

			Если смартОбщегоНазначения.смартДействуетОсобыйУчетСерий(СтрокаТовара.Номенклатура) 
				И ЗначениеЗаполнено(смартДатаНачалаСерийногоУчетаВременная) Тогда
				
				ДатаОбъекта = смартОбщегоНазначения.смартПолучитьДатуОбъектаДляРасчетаСтатусовСерий(СтрокаТовара, ПараметрыУказанияСерий);
				
				Если НЕ ДатаОбъекта = НачалоДня(ДатаОбъекта) Тогда		 
					ДатаНачалаСерийногоУчетаНеНаступила = ДатаОбъекта < смартДатаНачалаСерийногоУчетаВременная;
				Иначе	
					ДатаНачалаСерийногоУчетаНеНаступила = НачалоДня(ДатаОбъекта) < НачалоДня(смартДатаНачалаСерийногоУчетаВременная);
				КонецЕсли;	
						 
				Если ДатаНачалаСерийногоУчетаНеНаступила Тогда
					Объект.СтатусУказанияСерий = 0;
				КонецЕсли;
				
			КонецЕсли;
			//-- #Б-2794 смарт: Лопато 26.03.2025
			#КонецВставки
			
		КонецЕсли;
	Иначе

		Выборка = ВыборкаИзЗапросаРасчетаСтатусовУказанияСерий(ПараметрыУказанияСерий,
		Объект[ПараметрыУказанияСерий.ИмяТЧТовары],
		Объект[ПараметрыУказанияСерий.ИмяТЧСерии],
		Склад,
		СтрокиТоваровДляОбработки,
		СтрокиСерийДляОбработки);

		Пока Выборка.Следующий() Цикл
			СтрТабл = Объект[ПараметрыУказанияСерий.ИмяТЧТовары][Выборка.НомерСтроки - 1];
			Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
				
				#Удаление
				СтрТабл.СтатусУказанияСерий = Выборка.СтатусУказанияСерий;
				#КонецУдаления
				
				#Вставка
				//++ #1351 смарт: Фролов 15.05.2023 //Разделение остатков по организациям в заказах 
				//Временно удален функционал проверки по дате, после изменения учета по серийным номерам
				////Каратеев ++
				////СтрТабл.СтатусУказанияСерий = Выборка.СтатусУказанияСерий;

				////Отмена проверки заполнения серии в строке для старых документов
				//Если СтрТабл.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()
				//	И Пользователи.ЭтоПолноправныйПользователь()
				//	//И РольДоступна("смартНеПроверятьСерииВСтарыхДокументах")
				//	И Объект.Дата < Дата("20190101") Тогда
				//	СтрТабл.СтатусУказанияСерий = 0;
				//	Сообщить("Для номенклатуры "+СтрТабл.Номенклатура+" в строке №-"+СтрТабл.НомерСтроки+" должна быть указана серия. Ограничение прописано в процедуре ОбщийМодуль.НоменклатураСервер.смарт_ЗаполнитьСтатусыУказанияСерий");
				//Иначе
				//	СтрТабл.СтатусУказанияСерий = Выборка.СтатусУказанияСерий; //Строка типового функционала была без условия
				//КонецЕсли; 
				//Каратеев -- 
				СтрТабл.СтатусУказанияСерий = Выборка.СтатусУказанияСерий;
				//-- #1351 смарт: Фролов 15.05.2023
				#КонецВставки
				
			Иначе
				Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
					СтрТабл[ИмяПоляСтатус] = Выборка[ИмяПоляСтатус];
				КонецЦикла;
			КонецЕсли;
			
			#Вставка
			//++#1517 смарт: Лопато 03.04.2024 //Установка статуса указания серий по дате начала серийного учета номенклатуры
			смартДатаНачалаСерийногоУчетаВременная = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрТабл.Номенклатура, "смартДатаНачалаСерийногоУчетаВременная");

			Если смартОбщегоНазначения.смартДействуетОсобыйУчетСерий(СтрТабл.Номенклатура) 
				И ЗначениеЗаполнено(смартДатаНачалаСерийногоУчетаВременная) Тогда
				
				ДатаОбъекта = смартОбщегоНазначения.смартПолучитьДатуОбъектаДляРасчетаСтатусовСерий(СтрТабл, ПараметрыУказанияСерий, Объект);
				
				//++#1775 смарт: Лопато 12.04.2024 //Доработка возврата товара от клиента (продолжение 1547) серийный учет чернил  
				//Стоит галка в расходном ордере "Без серий"
				Если ПараметрыУказанияСерий.Свойство("ПолноеИмяОбъекта")
					И ПараметрыУказанияСерий.Свойство("ИмяТЧТовары") Тогда
					
					МетаданныеОбъекта = ОбщегоНазначенияУТ.МетаданныеОбъектаПоПолномуИмени(ПараметрыУказанияСерий.ПолноеИмяОбъекта);

					Если МетаданныеОбъекта.ТабличныеЧасти[ПараметрыУказанияСерий.ИмяТЧТовары].Реквизиты.Найти("смартОтгрузкаБезСерииСлужебныйВременный") <> Неопределено Тогда
						СтрокаБезСерий = СтрТабл.смартОтгрузкаБезСерииСлужебныйВременный;
					Иначе
						СтрокаБезСерий = Ложь;
					КонецЕсли;	

				Иначе
					
					СтрокаБезСерий = Ложь;
					
				КонецЕсли;	
					
				//Проверка отгрузки или оформления номенклатуры
				НоменклатураЗаказаОтгруженаИлиОформлена = Ложь;
					
				Если НЕ СтрокаБезСерий
					И (ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказКлиента"
					   ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаПеремещение" 
					   ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаСборку"
					   ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаВнутреннееПотребление") Тогда
					
					МассивНоменклатурыДляПроверки = Новый Массив;
					МассивНоменклатурыДляПроверки.Добавить(СтрТабл.Номенклатура);
					
					МассивНоменклатурыЗаказаОтгруженнойИлиОформленной = 
						смартОбщегоНазначения.смартПолучитьНоменклатуруЗаказаОтгруженнуюИлиОформленную(Объект.Ссылка, МассивНоменклатурыДляПроверки);
					
					НоменклатураЗаказаОтгруженаИлиОформлена = МассивНоменклатурыЗаказаОтгруженнойИлиОформленной.Количество();
					
				КонецЕсли;	
				
				Если НоменклатураЗаказаОтгруженаИлиОформлена ИЛИ НЕ ДатаОбъекта = НачалоДня(ДатаОбъекта) Тогда
					//Номенклатура отгружена, учитывать время перевода на серии
					ДатаНачалаСерийногоУчетаНеНаступила = (ДатаОбъекта < смартДатаНачалаСерийногоУчетаВременная);
				Иначе
					//Номенклатура не отгружена, требуется указание серий даже если время перевода на серии позже времени даты объекта
					ДатаНачалаСерийногоУчетаНеНаступила = (НачалоДня(ДатаОбъекта) < НачалоДня(смартДатаНачалаСерийногоУчетаВременная));
				КонецЕсли;	
					
				Если СтрокаБезСерий
					ИЛИ ДатаНачалаСерийногоУчетаНеНаступила Тогда
					
					//Серии не указываются
					Если ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Количество() = 0 Тогда
						СтрТабл.СтатусУказанияСерий = 0;
					Иначе
						Для Каждого ИмяПоляСтатус Из ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий Цикл
							СтрТабл[ИмяПоляСтатус] = 0;
						КонецЦикла;
					КонецЕсли;

				КонецЕсли;
                //--#1775 смарт: Лопато 12.04.2024
				
			КонецЕсли;
			//--#1517 смарт: Лопато 03.04.2024
			#КонецВставки
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ВыборкаИзЗапросаРасчетаСтатусовУказанияСерий")
Функция смарт_ВыборкаИзЗапросаРасчетаСтатусовУказанияСерий(ПараметрыУказанияСерий, ТаблицаТовары, ТаблицаСерии, Склад, СтрокиТоваровДляОбработки, СтрокиСерийДляОбработки)

	МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПараметрыУказанияСерий.ПолноеИмяОбъекта);
	
	ТекстЗапроса = МодульМенеджера.ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если ТипЗнч(Склад) = Тип("Структура") Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", Склад.Отправитель);
		Запрос.УстановитьПараметр("СкладПолучатель", Склад.Получатель);
	Иначе
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("СкладОтправитель", Склад);
		Запрос.УстановитьПараметр("СкладПолучатель", Склад);
	КонецЕсли;
	
	УстановитьПараметрыЗапросаПоПараметрамУказанияСерий(Запрос,ПараметрыУказанияСерий);
	
	Если ТипЗнч(ТаблицаТовары) = Тип("ТаблицаЗначений") Тогда
		ТаблицаТоварыПараметрЗапроса = ТаблицаТовары;
	Иначе
		Если СтрокиТоваровДляОбработки <> Неопределено Тогда
			ТаблицаТоварыПараметрЗапроса = ТаблицаТовары.Выгрузить(СтрокиТоваровДляОбработки);
		Иначе
			ТаблицаТоварыПараметрЗапроса = ТаблицаТовары.Выгрузить();
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаСерии) = Тип("ТаблицаЗначений") Тогда
		ТаблицаСерииПараметрЗапроса = ТаблицаСерии;
	Иначе
		Если СтрокиСерийДляОбработки <> Неопределено Тогда
			ТаблицаСерииПараметрЗапроса = ТаблицаСерии.Выгрузить(СтрокиСерийДляОбработки);
		Иначе
			ТаблицаСерииПараметрЗапроса = ТаблицаСерии.Выгрузить();
		КонецЕсли;
	КонецЕсли;
	
 	Запрос.УстановитьПараметр("Товары", ТаблицаТоварыПараметрЗапроса);
	Запрос.УстановитьПараметр("Серии", ТаблицаСерииПараметрЗапроса);
	
	УстановитьПривилегированныйРежим(Истина); // В перемещении товаров один из складов может быть недоступен пользователю
	
	#Вставка
	//++#1517 смарт: Лопато 10.01.2023 //Установка статуса указания серий по дате начала серийного учета номенклатуры
	ТекстЗапросаСерии = СтрЗаменить(Запрос.Текст, 
									"И Товары.Номенклатура.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка",
									"И (ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка)");
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаСерии);
	
	ПоследнийПакетЗапроса = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорВыбрать = ПоследнийПакетЗапроса.Операторы[0];
	
	ОтборЗапроса = ОператорВыбрать.Отбор;
	ОтборЗапроса.Очистить();

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	//--#1517 смарт: Лопато 10.01.2023

	//++ #1983 смарт: Лопато 18.09.2024 //Серийный учет для складов Инженеров  
	Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказКлиента"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.РеализацияТоваровУслуг"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.КорректировкаРеализации" 
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаявкаНаВозвратТоваровОтКлиента" 
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ВозвратТоваровОтКлиента"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаПеремещение" 
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПеремещениеТоваров"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ВнутреннееПотреблениеТоваров"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаВнутреннееПотребление"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаСборку"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.СборкаТоваров"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПриходныйОрдерНаТовары" 
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.РасходныйОрдерНаТовары"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ВводОстатков"
		ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Обработка.ПомощникПродаж" Тогда

		Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаПеремещение" 
			ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПеремещениеТоваров" Тогда
			
			//Изменение запроса для Заказа на перемещение и Перемещения товаров
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
							  		   "КОГДА ПолитикиУчетаСерийОтправитель.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям",
							  		   "КОГДА ПолитикиУчетаСерийОтправитель.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
										|		  ИЛИ (ПолитикиУчетаСерийОтправитель.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикиУчетаСерий.СерииНеИспользуются)
										|		     И ВЫРАЗИТЬ(ПолитикиУчетаСерийОтправитель.Склад КАК Справочник.Склады).смартНазначениеСклада = ЗНАЧЕНИЕ(Перечисление.смартНазначенияСкладов.ФизическоеЛицо)
										|		     И ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры В(&ВидыНоменклатурыОсобыеУсловияСерий))");

			Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПеремещениеТоваров" Тогда
			
				//Изменение запроса для Перемещения товаров
				Запрос.Текст = СтрЗаменить(Запрос.Текст, 
								  		   "КОГДА ПолитикиУчетаСерийПолучатель.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям",
								  		   "КОГДА ПолитикиУчетаСерийПолучатель.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
											|		  ИЛИ (ПолитикиУчетаСерийПолучатель.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикиУчетаСерий.СерииНеИспользуются)
											|		     И ВЫРАЗИТЬ(ПолитикиУчетаСерийПолучатель.Склад КАК Справочник.Склады).смартНазначениеСклада = ЗНАЧЕНИЕ(Перечисление.смартНазначенияСкладов.ФизическоеЛицо)
											|		     И ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры В(&ВидыНоменклатурыОсобыеУсловияСерий))");
				
			КонецЕсли;

		Иначе	
			
			//Общее изменение запроса для всех документов
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
							  		   "КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям",
							  		   "КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
										|		  ИЛИ (ПолитикиУчетаСерий.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикиУчетаСерий.СерииНеИспользуются)
										|		     И ВЫРАЗИТЬ(ПолитикиУчетаСерий.Склад КАК Справочник.Склады).смартНазначениеСклада = ЗНАЧЕНИЕ(Перечисление.смартНазначенияСкладов.ФизическоеЛицо)
										|		     И ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры В(&ВидыНоменклатурыОсобыеУсловияСерий))");
			
		КонецЕсли;
		
		Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПриходныйОрдерНаТовары" 
			ИЛИ ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.РасходныйОрдерНаТовары" Тогда
		
			//Изменение запроса для Приходного и Расходнго ордеров на товары
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
							  		   "КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки",
							  		   "КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПланированииОтгрузки
										|		  ИЛИ (ПолитикиУчетаСерий.ПолитикаУчетаСерий = ЗНАЧЕНИЕ(Справочник.ПолитикиУчетаСерий.СерииНеИспользуются)
										|		     И ВЫРАЗИТЬ(ПолитикиУчетаСерий.Склад КАК Справочник.Склады).смартНазначениеСклада = ЗНАЧЕНИЕ(Перечисление.смартНазначенияСкладов.ФизическоеЛицо)
										|		     И ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры В(&ВидыНоменклатурыОсобыеУсловияСерий))");

		КонецЕсли;
		
		//++ #Б-2794 смарт: Лопато 26.03.2025 //Документ Заказ на сборку. Не отображается поле Серия.  
		Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗаказНаСборку"
			И ПараметрыУказанияСерий.ТоварВШапке Тогда
		
			//Изменение запроса для Сборки товаров
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
							  		   "ИЛИ НЕ Товары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))",
							  		   "");
			
		КонецЕсли;
		//-- #Б-2794 смарт: Лопато 26.03.2025

		//Механизм действует только для видов номеклатуры с особыми условиями заполнения серий
		ВидыНоменклатурыОсобыеУсловияСерий = Новый Массив;	
		
		МассивСтруктурОсобыеУсловия	= смартОбщегоНазначения.смартПолучитьПредопределенноеЗначениеТЧСписокЗначений("ОсобыеУсловияЗаполненияСерийПоВидамНоменклатуры");
			
		Для Каждого СтруктураОсобыеУсловия Из МассивСтруктурОсобыеУсловия Цикл

			Если ЗначениеЗаполнено(СтруктураОсобыеУсловия.К1) 
				И ТипЗнч(СтруктураОсобыеУсловия.К1) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
				
				ВидыНоменклатурыОсобыеУсловияСерий.Добавить(СтруктураОсобыеУсловия.К1);
				
			КонецЕсли;

		КонецЦикла;	
		
		Запрос.УстановитьПараметр("ВидыНоменклатурыОсобыеУсловияСерий", ВидыНоменклатурыОсобыеУсловияСерий);
		
	КонецЕсли;	
	//-- #1983 смарт: Лопато 18.09.2024
	#КонецВставки
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

// Процедура проверки заполнения колонок "Рекламного воздействия" в объектах
// Параметры:
//	Объект - ДокументОбъект (СправочникОбъект и т.п.)
//  МассивНепроверяемыхРеквизитов - массив реквизитов, которые не нужно проверять платформенной проверкой
//	Отказ - отказ продолжения операции
//	ПараметрыЗаполнения - Структура - см. НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик
//
Процедура РасшСмарт_ПроверитьЗаполнениеРекламноеВоздействие(Объект,МассивНепроверяемыхРеквизитов,Отказ,ПараметрыПроверки = Неопределено) Экспорт
	
	Если ПараметрыПроверки = Неопределено Тогда
		ПараметрыПроверки = РасшСмарт_ПараметрыПроверкиЗаполненияРекламноеВоздействие();
	КонецЕсли;
	
	ИмяТЧ                 = ПараметрыПроверки.ИмяТЧ;
	СписокСтрок           = ПараметрыПроверки.СписокСтрок;
	ВыводитьНомераСтрок   = ПараметрыПроверки.ВыводитьНомераСтрок;
	
	МассивНепроверяемыхРеквизитов.Добавить(ИмяТЧ+".РекламноеВоздействие");
	
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.РекламноеВоздействие КАК РекламноеВоздействие
	|ПОМЕСТИТЬ СтрокиСОшибками
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.РекламноеВоздействие = ЗНАЧЕНИЕ(Справочник.смартИсточникиРекламногоВоздействия.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСОшибками.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	//++ смарт:ММ #042 222 26.03.2020 Рефакторинг 
	//|		КОГДА ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры.Наименование ПОДОБНО ""ТоварПлоттерыСерии""
	|		КОГДА ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры = &ТоварПлоттерыСерии
	//-- смарт:ММ 26.03.2020
	|				И СтрокиСОшибками.РекламноеВоздействие = ЗНАЧЕНИЕ(Справочник.смартИсточникиРекламногоВоздействия.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеЗаполненоРекламноеВоздействие
	|ИЗ
	|	СтрокиСОшибками КАК СтрокиСОшибками
	|ГДЕ
	//++ смарт:ММ #042 222 26.03.2020 Рефакторинг 
	//|	ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры.Наименование ПОДОБНО ""ТоварПлоттерыСерии""
	|	ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры = &ТоварПлоттерыСерии
	//-- смарт:ММ 26.03.2020
	|	И СтрокиСОшибками.РекламноеВоздействие = ЗНАЧЕНИЕ(Справочник.смартИсточникиРекламногоВоздействия.ПустаяСсылка)";
	
	Запрос.Текст = ТекстЗапроса;
	
	//++ смарт:ММ #042 222 26.03.2020 Рефакторинг
	ТоварПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	Запрос.УстановитьПараметр("ТоварПлоттерыСерии", ТоварПлоттерыСерии);
	//-- смарт:ММ 26.03.2020
	
	Запрос.УстановитьПараметр("ТаблицаТоваров",
		Объект[ИмяТЧ].Выгрузить(СписокСтрок,
			"НомерСтроки,Номенклатура,РекламноеВоздействие"));//+СтрокаДопРеквизитов));
	
	Если ВыводитьНомераСтрок Тогда
		ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%РекламноеВоздействие%"" в строке %НомерСтроки% списка ""%ТаблицаТовары%"".'");
	Иначе
		ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%РекламноеВоздействие%"" в списке ""%ТаблицаТовары%"".'");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ТипЗнч(Объект) = Тип("УправляемаяФорма") Тогда
		МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	Иначе
		МетаданныеОбъекта = Объект.Метаданные();
	КонецЕсли;
	
	ПредставлениеТЧ								= МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Синоним;
	ПредставлениеРеквизитаРекламноеВоздействие	= МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Реквизиты.РекламноеВоздействие.Синоним;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НеЗаполненоРекламноеВоздействие Тогда
			
			ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%РекламноеВоздействие%", ПредставлениеРеквизитаРекламноеВоздействие);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТаблицаТовары%", ПредставлениеТЧ);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", Выборка.НомерСтроки);
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, Выборка.НомерСтроки, "РекламноеВоздействие");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,КлючДанных,Поле,"Объект",Отказ);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

//++ #1338 смарт: Фролов 10.04.2023 //Мелкие доработки
//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
Процедура смарт_ПроверитьЗаполнениесмартКтоПередал(Объект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки = Неопределено, ИмяРеквизита = "смартКтоПередал") Экспорт
	
	Если ПараметрыПроверки = Неопределено Тогда
		ПараметрыПроверки = смарт_ПараметрыПроверкиЗаполненияКтоПередал();
	КонецЕсли;
	
	ИмяТЧ                 = ПараметрыПроверки.ИмяТЧ;
	СписокСтрок           = ПараметрыПроверки.СписокСтрок;
	ВыводитьНомераСтрок   = ПараметрыПроверки.ВыводитьНомераСтрок;
	
	//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
	МассивНепроверяемыхРеквизитов.Добавить(СтрШаблон("%1.%2", ИмяТЧ, ИмяРеквизита));
	//-- #1936 смарт: Шляпников 20.01.2025
	
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(Объект);
	
	//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
	Запрос = Новый Запрос;
	ТекстЗапроса = СтрШаблон(
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.%1 КАК %1
	|ПОМЕСТИТЬ СтрокиСОшибками
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.%1 = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСОшибками.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры = &ТоварПлоттерыСерии
	|				И СтрокиСОшибками.%1 = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеЗаполнено
	|ИЗ
	|	СтрокиСОшибками КАК СтрокиСОшибками
	|ГДЕ
	|	ВЫРАЗИТЬ(СтрокиСОшибками.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры = &ТоварПлоттерыСерии
	|	И СтрокиСОшибками.%1 = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)", ИмяРеквизита);
	//-- #1936 смарт: Шляпников 20.01.2025
	
	Запрос.Текст = ТекстЗапроса;
	
	ТоварПлоттерыСерии = Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение;
	Запрос.УстановитьПараметр("ТоварПлоттерыСерии", ТоварПлоттерыСерии);
	
	//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
	Запрос.УстановитьПараметр("ТаблицаТоваров",
		Объект[ИмяТЧ].Выгрузить(СписокСтрок,
			СтрШаблон("НомерСтроки,Номенклатура,%1", ИмяРеквизита)));//+СтрокаДопРеквизитов));
	
	Если ВыводитьНомераСтрок Тогда
		ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в строке ""%2"" списка ""%3"".'");
	Иначе
		ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в списке ""%3"".'");
	КонецЕсли;
	//-- #1936 смарт: Шляпников 20.01.2025
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ТипЗнч(Объект) = Тип("УправляемаяФорма") Тогда
		МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	Иначе
		МетаданныеОбъекта = Объект.Метаданные();
	КонецЕсли;
	
	ПредставлениеТЧ = МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Синоним;
	//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
	ПредставлениеРеквизита = МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ].Реквизиты[ИмяРеквизита].Синоним;
	//-- #1936 смарт: Шляпников 20.01.2025
	
	Пока Выборка.Следующий() Цикл
		
		//++ #1936 смарт: Шляпников 20.01.2025 / Добавить колонку в заказ клиента "кто консультировал" и вывод в отчет
		Если Выборка.НеЗаполнено Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеРеквизита, Выборка.НомерСтроки, ПредставлениеТЧ);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, Выборка.НомерСтроки, ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, "Объект", Отказ);
			
		КонецЕсли;
		//-- #1936 смарт: Шляпников 20.01.2025
		
	КонецЦикла;
		
КонецПроцедуры //-- #1338 смарт: Фролов 10.04.2023

// Функция возвращает параметры проверки заполнения рекламного воздейстия
//
//	Возвращаемое значение:
//		Структура:
//			*ИмяТЧ - Строка - значение по умолчанию "Товары"
//			*СуффиксДопРеквизита - Строка - значение по умолчанию "" - если в ТЧ два реквизита "РекламноеВоздействие", то второй назван с суффиком. 
//											если суффикс передан, то проверяются оба реквизита
//          *СписокСтрок - Массив, Неопределенно - значение по умолчанию Неопределенно
//			*ВыводитьНомераСтрок - Булево - значение по умолчанию Истина
//			*ОтборПроверяемыхСтрок - Структура - значение по умолчанию пустая Структура
//
Функция РасшСмарт_ПараметрыПроверкиЗаполненияРекламноеВоздействие() Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИмяТЧ",                 "Товары");		
	ПараметрыПроверки.Вставить("СписокСтрок",           Неопределено);
	ПараметрыПроверки.Вставить("ВыводитьНомераСтрок",   Истина);
	ПараметрыПроверки.Вставить("ОтборПроверяемыхСтрок", Новый Структура);
	
	Возврат ПараметрыПроверки;
	
КонецФункции

//++ #1338 смарт: Фролов 12.04.2023 //Мелкие доработки
Функция смарт_ПараметрыПроверкиЗаполненияКтоПередал() Экспорт
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ИмяТЧ",                 "Товары");		
	ПараметрыПроверки.Вставить("СписокСтрок",           Неопределено);
	ПараметрыПроверки.Вставить("ВыводитьНомераСтрок",   Истина);
	ПараметрыПроверки.Вставить("ОтборПроверяемыхСтрок", Новый Структура);
	
	Возврат ПараметрыПроверки;
	
КонецФункции //-- #1338 смарт: Фролов 12.04.2023

#КонецОбласти
